In [1]:
import pandas as pd
import numpy as np

1) Create a Sales Dictionary:

In [2]:
sales = {
    'Tony': 103,
    'Sally': 202,
    "Randy": 380,
    "Ellen": 101,
    "Fred": 82
}

and Region Dictionary:

In [3]:
region = {
    'Tony': "West",
    'Sally': "South",
    "Carl": "West",
    "Archie": "North",
    "Randy": "East",
    "Ellen": "South",
    "Fred": np.nan,
    "Mo": "East",
    "HanWei": np.nan
}

a) Create Sales Dataframe and Region Dataframe using above Dictionaries
note: pd.DataFrame.from_dict()

In [4]:
salesdf = pd.DataFrame.from_dict(sales, orient="index", columns=["sales"])
salesdf

       sales
Tony     103
Sally    202
Randy    380
Ellen    101
Fred      82

In [5]:
regiondf = pd.DataFrame.from_dict(region, orient="index", columns=["region"])
regiondf

       region
Tony     West
Sally   South
Carl     West
Archie  North
Randy    East
Ellen   South
Fred      NaN
Mo       East
HanWei    NaN

b) Write the python command to get the below output:

In [6]:
# pd.concat([regiondf, salesdf], axis=1)
regiondf.join(salesdf)

       region  sales
Tony     West  103.0
Sally   South  202.0
Carl     West    NaN
Archie  North    NaN
Randy    East  380.0
Ellen   South  101.0
Fred      NaN   82.0
Mo       East    NaN
HanWei    NaN    NaN

c) Write the python command to get the below output:

In [7]:
# salesdf.join(regiondf)
df_inner = regiondf.join(salesdf, how="inner")
df_inner

      region  sales
Tony    West    103
Sally  South    202
Randy   East    380
Ellen  South    101
Fred     NaN     82

d) Write the python command to get the below output:

In [10]:
# df = regiondf.join(salesdf).dropna().groupby('region').sum()
# df["sales"] = df["sales"].astype(int)
# df2 = df
# df_sales_region = df.reset_index()
# df2, df_sales_region

df_grouped = df_inner.groupby('region').sum()
df_grouped.reset_index(inplace=True)
df_grouped

  region  sales
0   East    380
1  South    303
2   West    103

e) Write the python command to get the below output:

In [16]:
df3 = pd.merge(df_inner, df_grouped, on="region", how="outer", suffixes=("", "_region"))
df3

  region  sales  sales_region
0   West    103         103.0
1  South    202         303.0
2  South    101         303.0
3   East    380         380.0
4    NaN     82           NaN

f) Write the python command to get the below output:

In [19]:
# df3 = pd.merge(df_inner, df2, on="region",
#                suffixes=("", "_region"))
# df3

# df3 = df_inner.merge(df_grouped, on="region",
#                        suffixes=("", "_region"))

df4 = df3.set_index(df_inner.index)
df4.dropna()

      region  sales  sales_region
Tony    West    103         103.0
Sally  South    202         303.0
Randy  South    101         303.0
Ellen   East    380         380.0

g) Write the python command to get the below output:

In [20]:
# df3 = pd.merge(df_inner, df2, on="region", how="outer",
#                suffixes=("", "_region"))
# df3

df5 = df3.set_index(df_inner.index)
df5

      region  sales  sales_region
Tony    West    103         103.0
Sally  South    202         303.0
Randy  South    101         303.0
Ellen   East    380         380.0
Fred     NaN     82           NaN